app/controllers/sessions_controller.rb

  def index
    @user = User.find(session[:user_id]) # < recalls the value set in a previous request
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def create
   auth_hash = request.env['omniauth.auth']
   redirect to login_failure_path unless auth_hash['uid']

   @user = User.find_by(uid: auth_hash[:uid], provider: 'github')
---
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? AND "users"."provider" = ? LIMIT 1  [["uid", 16520733], ["provider", "github"]]