app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."users_id" = ?  [["users_id", 1]]
---
  def index
    # @tasks = Task.all
    @tasks = Task.where(users_id: session[:user_id])

INSERT INTO "tasks" ("name", "description", "completed_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "hi"], ["description", "do thing thing"], ["completed_at", "2016-09-28"], ["created_at", "2016-09-29 22:45:00.189112"], ["updated_at", "2016-09-29 22:45:00.189112"]]
---
  def create
    @task = Task.new(task_params)
    @task.users_id = session[:user_id]
    if @task.save

UPDATE "tasks" SET "name" = ?, "completed_at" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["name", "hihi"], ["completed_at", nil], ["updated_at", "2016-09-30 16:43:21.923464"], ["id", 9]]
---
  def update
    # @task = Task.find(params[:id])
    if @task.update(task_params)

UPDATE "tasks" SET "completed" = ?, "completed_at" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", "t"], ["completed_at", "2016-09-30"], ["updated_at", "2016-09-30 17:51:46.577349"], ["id", 10]]
---
  def complete
    @task.completed = true
    @task.completed_at = DateTime.now.to_date
    @task.save

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 8]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 8]]
---
  def destroy
    Task.find(params[:id]).destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 10]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def find_task
    if Task.find(params[:id]).users_id == session[:user_id]